In [1]:
from pandasql import sqldf
import pandas as pd

In [2]:
# Create the Student Data Frame

students= {
    'Students':["Sira","Ibrahim","Moussa","Mamadou","Nabintou"],
    'Gender':['Female','Male','Male', "Male", "Female"],
    'Age':[18, 27, 19, 22, 21],
    'Email': ["sira@info.com", "ib@info.com", "mouss@info.com", 
             "mam@info.com", "nab@info.com"]
          }
students_df = pd.DataFrame(students)

students_df

   Students  Gender  Age           Email
0      Sira  Female   18   sira@info.com
1   Ibrahim    Male   27     ib@info.com
2    Moussa    Male   19  mouss@info.com
3   Mamadou    Male   22    mam@info.com
4  Nabintou  Female   21    nab@info.com

In [3]:
# Create the Teaching Assistant Data Frame

teaching_assistant= {
    'Teacher':["Ibrahim","Nabintou","Mamadou","Fatim","Aziz"],
    'Email':['ib@info.com','nab@info.com','mam@info.com', 
             "fat@info.com", "aziz@info.com"],
    'Degree':["M.S in Data Science", "B.S in Statistics", 
              "B. Comp Sc", "M.S. Architecture", "B.S in Accounting"],
    'Department': ["Business", "Statistics", "Comp Sc", 
             "Engineering", "Business"]
          }
teaching_assistant_df = pd.DataFrame(teaching_assistant)

teaching_assistant_df

    Teacher          Email               Degree   Department
0   Ibrahim    ib@info.com  M.S in Data Science     Business
1  Nabintou   nab@info.com    B.S in Statistics   Statistics
2   Mamadou   mam@info.com           B. Comp Sc      Comp Sc
3     Fatim   fat@info.com    M.S. Architecture  Engineering
4      Aziz  aziz@info.com    B.S in Accounting     Business

In [4]:
all_students = sqldf("SELECT * FROM students_df")
all_students

   Students  Gender  Age           Email
0      Sira  Female   18   sira@info.com
1   Ibrahim    Male   27     ib@info.com
2    Moussa    Male   19  mouss@info.com
3   Mamadou    Male   22    mam@info.com
4  Nabintou  Female   21    nab@info.com

In [5]:
# Check the type of all_students
print(type(all_students))

# Run Pandas Statement to show the type of the columns
print("---"*10)
print(all_students.dtypes)

<class 'pandas.core.frame.DataFrame'>
------------------------------
Students    object
Gender      object
Age          int64
Email       object
dtype: object

In [5]:
# Query definition
query = """ SELECT Students, Email 
            FROM students_df 
            LIMIT 3
        """
# Query execution
name_email = sqldf(query)
name_email

  Students           Email
0     Sira   sira@info.com
1  Ibrahim     ib@info.com
2   Moussa  mouss@info.com

In [6]:
# Define the query
query = """SELECT * 
           FROM students_df 
           WHERE Gender = 'Female'
        """

# Execute the query
female_student = sqldf(query)
female_student

   Students  Gender  Age          Email
0      Sira  Female   18  sira@info.com
1  Nabintou  Female   21   nab@info.com

In [7]:
query = """ SELECT Teacher, Email, Degree 
            FROM teaching_assistant_df 
            WHERE Degree LIKE 'M.S%'
            """
ms_students = sqldf(query)
ms_students

   Teacher         Email               Degree
0  Ibrahim   ib@info.com  M.S in Data Science
1    Fatim  fat@info.com    M.S. Architecture

#### Alternative pathway in pandas

In [9]:
cols_to_get = ['Teacher', 'Email', 'Degree']
teaching_assistant_df[teaching_assistant_df.Degree.str.startswith('M.S')][cols_to_get]

   Teacher         Email               Degree
0  Ibrahim   ib@info.com  M.S in Data Science
3    Fatim  fat@info.com    M.S. Architecture

In [10]:
query = """ SELECT AVG(Age), Gender 
            FROM students_df 
            GROUP BY Gender
        """
avg_age = sqldf(query)
avg_age

    AVG(Age)  Gender
0  19.500000  Female
1  22.666667    Male

In [11]:
query = """ SELECT st.Students, st.Gender, st.Email, st.Age, tat.Department
            FROM students_df st INNER JOIN teaching_assistant_df tat 
            ON st.Email = tat.Email;
            """

result = sqldf(query)
result

   Students  Gender         Email  Age  Department
0   Ibrahim    Male   ib@info.com   27    Business
1   Mamadou    Male  mam@info.com   22     Comp Sc
2  Nabintou  Female  nab@info.com   21  Statistics

### Common Table Expressions
A Common Table Expression is a temporary result set, and it can be result of complex sub query.
It is defined by using (WITH) clause. It improves readability and it is created in memory rather
than TempDB database where Temp Table and Table variable is created

In [8]:
query = """ WITH New AS (SELECT * 
            FROM teaching_assistant_df 
            WHERE Degree LIKE 'M.S%')
            SELECT Teacher, Email, Degree
            FROM New
            ORDER BY Teacher 
            """
msstudents = sqldf(query)
msstudents

   Teacher         Email               Degree
0    Fatim  fat@info.com    M.S. Architecture
1  Ibrahim   ib@info.com  M.S in Data Science

In [1]:
conda install ydata_profiling

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... unsuccessful initial attempt using frozen solve. Retrying with flexible solve.
Collecting package metadata (repodata.json): ...working... done
Solving environment: ...working... unsuccessful initial attempt using frozen solve. Retrying with flexible solve.

Note: you may need to restart the kernel to use updated packages.

PackagesNotFoundError: The following packages are not available from current channels:

  - ydata_profiling

Current channels:

  - https://repo.anaconda.com/pkgs/main/win-64
  - https://repo.anaconda.com/pkgs/main/noarch
  - https://repo.anaconda.com/pkgs/r/win-64
  - https://repo.anaconda.com/pkgs/r/noarch
  - https://repo.anaconda.com/pkgs/msys2/win-64
  - https://repo.anaconda.com/pkgs/msys2/noarch

To search for alternate channels that may provide the conda package you're
looking for, navigate to

    https://anaconda.org

and use the search bar at the top of the page.

In [2]:
import pandas as pd
from pandasql import sqldf

# Sample DataFrame
data = {
    'student_id': [1, 2, 3, 4, 5],
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'age': [20, 21, 19, 22, 20],
    'grade': [85, 90, 88, 95, 82]
}
df = pd.DataFrame(data)
df

   student_id     name  age  grade
0           1    Alice   20     85
1           2      Bob   21     90
2           3  Charlie   19     88
3           4    David   22     95
4           5      Eve   20     82

In [3]:
# Example SQL query using pandasql
query = """
    SELECT name, age, grade
    FROM df
    WHERE age > 20
"""

# Execute the query
result_df = sqldf(query, locals())
print(result_df)

    name  age  grade
0    Bob   21     90
1  David   22     95

## Explanation:
1.Importing Libraries: We start by importing pandas (pd) and sqldf from pandasql. sqldf is a function that allows us to execute SQL queries on pandas DataFrames.

2.Creating a DataFrame: We create a sample pandas DataFrame df containing columns student_id, name, age, and grade.

3.SQL Query: We define an SQL query using triple quotes (""") for multi-line strings. The query selects the name, age, and grade columns from the DataFrame df where the age is greater than 20.

4.Executing the Query: We use the sqldf function to execute the SQL query. The query parameter is the SQL query string, and locals() is passed as a context dictionary to allow access to the df DataFrame within the SQL query.

5.Output: The result of the SQL query is stored in result_df, which is then printed to the console.

## Advantages of pandasql:
•SQL Familiarity: If you're comfortable with SQL syntax, pandasql allows you to leverage your SQL skills directly on pandas DataFrames.

•Complex Queries: It simplifies complex data manipulations and aggregations that might be cumbersome to write in native pandas syntax.

•Integration: It seamlessly integrates SQL operations with pandas, making it easier to combine SQL-based data processing with Python-based data analysis workflows.
Overall, pandasql is a useful tool for data analysts and scientists who are proficient in SQL and want to apply SQL queries to manipulate pandas DataFrames effectively.